{
    "Convert String To Int [LP]":"Convert String To Int",
    "Convert String To Float [LP]":"Convert String To Float",
    "Convert String To Bool [LP]":"Convert String To Bool",
    "Convert String To Number [LP]":"Convert String To Number",
    "Convert String To Combo [LP]":"Convert String To Combo",
    "Convert Int To String [LP]":"Convert Int To String",
    "Convert Float To String [LP]":"Convert Float To String",
    "Convert Bool To String [LP]":"Convert Bool To String",
    "Convert Float To Int [LP]":"Convert Float To Int",
    "Convert Int To Float [LP]":"Convert Int To Float",
    "Convert Int To Bool [LP]":"Convert Int To Bool",
    "Convert Bool To Int [LP]":"Convert Bool To Int",
    "Image Overlay [LP]":"Image Overlay",
    "Fast Checker Pattern [LP]":"Fast Checker Pattern",
    "Image Remove Background [LP]":"Removes background for images with user-defined model",
    "File Counter [LP]":"Counts the number of files in the specified folder",
    "Image Loader From Path [LP]":"Loading multiple images from specific folder",
    "Load Image [LP]":"Load Image by filepath",
    "Preview Image Bridge [LP]":"Preview Image Bridge is needed for conditions, cycles and other cases when it is necessary to output an image with an output connection. It has an output pin, unlike the usual Preview Image.",
    "Load LoRA Tag [LP]":"Loads lores by text tags from a text field. An implementation that exactly copies the behavior of Automatic1111 or ForgeWebUI.",
    "Simple Float Slider [LP]":"A simple slider that has no precision or upper/lower values settings. From 0.00000 to 1.00000",
    "Simple Float Slider - Tenths Step [LP]":"A simple slider that has no precision or upper/lower values settings. From 0.0 to 1.0",
    "Simple Float Slider - Hundredths Step [LP]":"A simple slider that has no precision or upper/lower values settings. From 0.00 to 1.00",
    "Text [LP]":"Input fields for multiline text",
    "String [LP]":"Input fields for single-line text (string)",
    "Find Value From File [LP]":"Finding a value by key from a text file",
    "Show Text [LP]":"Show Text node",
    "Show Text Bridge [LP]":"Show Text node for conditions and cycles",
    "Tag Category [LP]":"Defines categories for tags that are passed as input. By default, a list with categories placed on custom_nodes/ComfyUI-LevelPixel/nodes/tags/tag_category.json",
    "Tag Category Filter [LP]":"Filters tags to exclude or keep only those that match the specified categories.",
    "Tag Category Keeper [LP]":"Filters tags to keep only those that match the specified categories.",
    "Tag Category Remover [LP]":"Filters tags to exclude only those that match the specified categories.",
    "Tag Switcher [LP]":"Tag Switcher",
    "Tag Merger [LP]":"Tag Merger",
    "Tag Replace [LP]":"Tag Replace",
    "Tag Remover [LP]":"Removes the specified tags from the text",
    "Resorting Tags [LP]":"Merge and re-sort input arrays of tags using a rating system, producing sorted and combined text (tags). The node is needed to create the most relevant tags by combining several tag variants from different neural models (from LLM, VLM, and others) and selecting the best and most frequently occurring ones. Use with the Text To List node. Input tags from priority_texts have a higher rating and are all used in the output set. Input tags from inclusive_texts have a medium rating and are all used in the output set. Input tags from auxiliary_texts have a lower rating, and tags that are not in priority_texts and inclusive_texts will not be added to the output tag set.",
    "Remove Duplicate Tags [LP]":"Removes duplicate tags, leaving only one tag in the text.",
    "Keep Only English Tags [LP]":"Removes all tags with symbols that do not correspond to English characters. The entire tag is removed (from comma to comma), regardless of whether it contains English characters along with other characters. The node is needed to exclude any words and characters from tags except English.",
    "Remove Banned Tags From Tags [LP]":"Removes from the text those tags that are prohibited for use by the user. By default, a list with names of people and brands protected by copyright is used at custom_nodes/ComfyUI-LevelPixel/nodes/tags/example_banned_tags.txt.",
    "Remove Banned Tags From Text [LP]":"Removes from the tag list those tags that are prohibited for use by the user. By default, a list with names of people and brands protected by copyright is used at custom_nodes/ComfyUI-LevelPixel/nodes/tags/example_banned_tags.txt.",
    "Text Choice Parser [LP]":"Randomly (or by the specified number) selects the text that is specified in curly brackets with the separator |. You can also set variables in the text using square brackets and replace them in the second field using the syntax variable=value. Convenient for mass generation and controlled substitution of text in the general prompt.",
    "CLIP Text Encode Translate [LP]":"Tranlsate text from any languages to english",
    "Text Translate [LP]":"Tranlsate text from any languages to english",
    "Text To List [LP]":"Convert many texts to list of texts",
    "Split Compound Text [LP]":"Split Compound Text",
    "Keep Only English Words [LP]":"Removes all words with symbols that do not correspond to English symbols. The entire word is removed (from space to space), regardless of whether it contains English symbols along with other symbols. The node is necessary for excluding any words and symbols from the text except English.",
    "Model Unloader [LP]":"Unloads all neural models that are in the model manager from VRAM. Does not unload models that are loaded into VRAM bypassing the model manager.",
    "Soft Model Unloader [LP]":"Unloads from VRAM those files and cache that are not currently in use. Does not unload models.",
    "Hard Model Unloader [LP]":"Unloads all neural models that are in the model manager from VRAM. Does not unload models that are loaded into VRAM bypassing the model manager.",
    "Override CLIP Device [LP]":"Changes the main computing processor and the RAM used for CLIP. You can specify any video card or processor that is available in the system.",
    "Override VAE Device [LP]":"Changes the main computing processor and the RAM used for VAE. You can specify any video card or processor that is available in the system.",
    "Delay [LP]":"Delay",
    "Autotagger [LP]":"Autotagger based on the latest version of the WD tagging model from SmilingWolf.",
    "Seed [LP]":"Seed",
    "String Cycler [LP]":"String Cycler",
    "Text Replace [LP]":"Text Replace",
    "Pipe [LP]":"Pipe",
    "Pipe In [LP]":"Pipe In",
    "Pipe Out [LP]":"Pipe Out"
}